src/mp_toir/InformationRegisters/ЖурналРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРезультатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщенийЖурналаРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/Апи_БазыЕРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Апи_БазыЕРП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ERP_YKUZ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_YU</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_KGOK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_Test</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_РегистрацияПроверокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_РегистрацияПроверокОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбъектаЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Documents/НаработкаОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НаработкаОбъектовЭксплуатации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мп_СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/ОбъектыЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мечел_ТехнологическиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаработкаНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/CommonModules/ОбщегоНазначенияВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияВызовСервера: Процедуры и функции вызова сервера
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Проверяет наличие пользователей в приложении
//
// Возвращаемое значение:
//   - Булево - Истина, пользователи есть и регистрация пройдена. Ложь, новое устройство.
//
Функция ПриложениеЗарегистрировано() Экспорт
	
	Возврат Справочники.Пользователи.ЕстьПользователиВБазе();
	
КонецФункции

// Функция - Проверка режима обмена данными
//
// Возвращаемое значение:
//   - Булево - Истина, оналайн обмен включен, Ложь в противном случае.
//
Функция ЭтоОбменОнлайн() Экспорт

	Возврат Истина;

КонецФункции

// Функция - Проверка ТЧ документа на необработанные строки, не заполнен штрихкод и факт
// 				или незаполнен штрихкод, а факт заполнен
//
// Параметры:
//  Товары	 - ТаблицаЗначений - Табличная часть документа
// 
// Возвращаемое значение:
//   - Булево - Истина, проверка не пройдена, Ложь в противном случае.
//
Функция ЕстьНеобработанныеСтрокиВДокументе(Товары) Экспорт
	
	Отбор = Новый Структура("СерияНомер, КоличествоФакт", "", 0);
	НеобработанныеСтроки = Товары.НайтиСтроки(Отбор);
	Если НеобработанныеСтроки.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Отбор = Новый Структура("СерияНомер, КоличествоФакт", "", 1);
	НеобработанныеСтроки = Товары.НайтиСтроки(Отбор);
	Если НеобработанныеСтроки.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Установить стиль оформления
//
Процедура УстановитьСтильОформления() Экспорт
	
	ИндексТемы = Константы.СтильОформления.Получить();
	Если НЕ ЗначениеЗаполнено(ИндексТемы) Тогда
		ГлавныйСтиль = БиблиотекаСтилей.Получить(4);
		Константы.СтильОформления.Установить(4);
	Иначе
		ГлавныйСтиль = БиблиотекаСтилей[Число(ИндексТемы)];
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создание каталогов для обмена файлами
//
// Параметры:
//  Каталог	 - Каталог - Созданный каталог для файлов обмена
//
Процедура СоздатьКаталоги(Каталог) Экспорт
	
	Разделитель = ПолучитьРазделительПути();
	мПути = СтрРазделить(Каталог, Разделитель);
	
	Для Сч = 1 По мПути.ВГраница() Цикл
		
		КаталогНаДиске = Новый Файл(мПути[Сч - 1] + Разделитель + мПути[Сч]);
		Если НЕ КаталогНаДиске.Существует() Тогда
			Попытка
				СоздатьКаталог(Каталог);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось создать каталог: " + Каталог;
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

#Область ИнициализацияУстройства

Процедура ПервоначальнаяНастройка() Экспорт
	
	// Формируем UUID устройства
	Если НЕ ИдентификаторУстановлен() Тогда
		Константы.ID.Установить(Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.УИДУзлаОбменаОстатков();
	
	// Заполняем параметры соединения
	ЗаполнитьПараметрыСоединения();
	
	// Интервал обмена 5 минут
	Константы.ИнтервалОбмена.Установить(5);
	
	// Очистка журнала
	РегистрыСведений.ЖурналРезультатов.ОчиститьЖурналРезультатов();
	
КонецПроцедуры

Функция ИдентификаторУстановлен() Экспорт
	
	Возврат ?(ЗначениеЗаполнено(Константы.ID.Получить()), Истина, Ложь);
	
КонецФункции

// Функция - Создать служебного пользователя
// 
// Возвращаемое значение:
//  Элемент служебного пользователя - СправочникиСсылка.Пользователи
//
Функция СоздатьСлужебногоПользователя() Экспорт
	
	НайденныйПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", "mechel");
	Если НайденныйПользователь.Пустая() Тогда
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("Служебный", Истина);
		ДанныеПользователя.Вставить("Недействителен", Ложь);
		ДанныеПользователя.Вставить("Наименование", "mechel");
		ДанныеПользователя.Вставить("Логин", "mechel");
		ДанныеПользователя.Вставить("ИдентификаторПользователяИБ", Новый УникальныйИдентификатор);
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйПользователь, ДанныеПользователя);
		
		НовыйПользователь.Записать();
	Иначе
		НовыйПользователь = НайденныйПользователь.Ссылка;
	КонецЕсли;
	
	Возврат НовыйПользователь.Ссылка;
	
КонецФункции

Процедура ДобавитьАдминистратораУстройства() Экспорт
	
	ПользовательНайден = Справочники.Пользователи.НайтиПоНаименованию("mechel", Истина);
	Если ПользовательНайден = Неопределено ИЛИ ПользовательНайден = Справочники.Пользователи.ПустаяСсылка() Тогда
		НовыйПользователь = СоздатьСлужебногоПользователя();
		ЗаполнитьСлужебногоПользователяИнфБазы(НовыйПользователь);
	Иначе
		ОчиститьПользователейИнфБазы();
		ЗаполнитьСлужебногоПользователяИнфБазы(ПользовательНайден);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебногоПользователяИнфБазы(Пользователь) Экспорт
	ИмяПользователя = Пользователь.Наименование;
	ИмяВходаПользователя = Пользователь.Логин;
	ВходВПрограммуРазрешен = НЕ Пользователь.Недействителен;
	АутентификацияСтандартная = Истина;
	АутентификацияWIndows = Ложь;
	ЗапрещеноИзменятьПароль = Истина;
	ПоказыватьВСпискеВыбора = Ложь;
	
	ОбновляемыеСвойства = Новый Структура;
	ОбновляемыеСвойства.Вставить("Действие", "Записать");
	ОбновляемыеСвойства.Вставить("ВходВПрограммуРазрешен", ВходВПрограммуРазрешен);
	ОбновляемыеСвойства.Вставить("Имя", ИмяВходаПользователя);
	ОбновляемыеСвойства.Вставить("ПолноеИмя", ИмяПользователя);
	ОбновляемыеСвойства.Вставить("АутентификацияOpenID", Ложь);
	ОбновляемыеСвойства.Вставить("АутентификацияСтандартная", АутентификацияСтандартная);
	ОбновляемыеСвойства.Вставить("АутентификацияWindows", АутентификацияWindows);
	ОбновляемыеСвойства.Вставить("ПарольУстановлен", Ложь);
	ОбновляемыеСвойства.Вставить("ЗапрещеноИзменятьПароль", ЗапрещеноИзменятьПароль);
	ОбновляемыеСвойства.Вставить("ПоказыватьВСпискеВыбора", ПоказыватьВСпискеВыбора);
	
	ПользовательНайден = ПользователиИнформационнойБазы.НайтиПоИмени("mechel");
	Если ПользовательНайден = Неопределено Тогда
		НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ЗаполнитьЗначенияСвойств(НовыйПользовательИБ, ОбновляемыеСвойства);
		НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовыйПользовательИБ.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьПользователейИнфБазы(Полностью = Истина) Экспорт
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ТекПользователь Из СписокПользователей Цикл
		Если ТекПользователь.Имя = "mechel" И Полностью = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ТекПользователь.Удалить();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Функция - Список значений штрихкодов номенклатуры
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Ссылка на номенклатуру
//
// Возвращаемое значение:
//   - СписокЗначений - Штрихкоды маркированной номенклатуры списком значений
//
Функция СписокШтрихкодовПоНоменклатуре(Номенклатура, ИсключитьСерии) Экспорт
	
	СписокЗначенийШтрихкоды = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Мечел_ЛазернаяМаркировка.СерияНомер КАК Штрихкод
		|ИЗ
		|	РегистрСведений.Мечел_ЛазернаяМаркировка КАК Мечел_ЛазернаяМаркировка
		|ГДЕ
		|	Мечел_ЛазернаяМаркировка.Номенклатура = &Номенклатура
		|	И Мечел_ЛазернаяМаркировка.ДатаМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ Мечел_ЛазернаяМаркировка.Серия В (&ИсключитьСерии)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИсключитьСерии", ИсключитьСерии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокЗначенийШтрихкоды;
	КонецЕсли;
	
	ТЗ = РезультатЗапроса.Выгрузить();
	МассивШтрихкодов = ТЗ.ВыгрузитьКолонку("Штрихкод");
	СписокЗначенийШтрихкоды.ЗагрузитьЗначения(МассивШтрихкодов);
	
	Возврат СписокЗначенийШтрихкоды;
	
КонецФункции

#Область ДанныеТОиР

// Функция - Объекты эксплуатации по тех месту
//
// Параметры:
//  ТехнологическоеМесто - Справочник.Мечел_ТехнологическиеМеста - Элемент справочника
//  ВернутьЭлемент - Булево - Если значение Истина то вернет 1 элемент справочника, иначе массив объектов эксплуатации
// 
// Возвращаемое значение:
//  Массив - объектов эксплуатации  - если ничего не найдено вернет Неопределено
//
Функция ОбъектыЭксплуатацииПоТехМесту(Знач ТехнологическоеМесто, ВернутьЭлемент = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|ГДЕ
	|	ОбъектыЭксплуатации.ТехнологическоеМесто В ИЕРАРХИИ(&ТехнологическоеМесто)
	|	И НЕ ОбъектыЭксплуатации.ПометкаУдаления
	|	И НЕ ОбъектыЭксплуатации.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ТехнологическоеМесто", ТехнологическоеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		СписокОЭ = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектЭксплуатации");
		Если ВернутьЭлемент Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Возврат Выборка.ОбъектЭксплуатации;
			Иначе
				Возврат СписокОЭ;
			КонецЕсли;
		Иначе
			Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектЭксплуатации");
		КонецЕсли;
	КонецЕсли;

КонецФункции

// Функция - Узлы объекта эксплуатации
// Получаем массив узлов объектов эксплуатации по выбранному параметру ОбъектЭксплуатации
// Если узлов нет, возвразает Неопределено
//
// Параметры:
//  ОбъектЭксплуатации - Справочник.ОбъектыЭксплуатации - Элемент справочника
// 
// Возвращаемое значение:
//  Массив - узлы объекта эксплуатации 
//
Функция УзлыОбъектаЭксплуатации(Знач ОбъектЭксплуатации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Ссылка КАК Узлы
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Владелец В ИЕРАРХИИ(&ОбъектЭксплуатации)
	|	И НЕ УзлыОбъектовЭксплуатации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узлы");
	КонецЕсли;

КонецФункции

// Функция - Редактирование формы документа ТОиР
// определяет доступность редактирвоания документа по ролям
//
// Параметры:
//  Подразделение	 - Справочник.СтруктураПредприятия 	  - Подразделение документа
//  Ответственный	  - Справочник.Пользователи 	 - Ответственный документа
//  СтатусОбмена	-  Перечисление.мп_СтатусыОбмена 	 - Статус обмена документа
// 
// Возвращаемое значение:
// Булево - Истина, если разрешено изменять форму документа, иначе Ложь
//
Функция РедактированиеФормыДокументаТОиР(Знач Подразделение, Знач Ответственный, Знач СтатусОбмена) Экспорт
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("мп_АдминистрированиеТОиР") Тогда
		Возврат Истина;
	ИначеЕсли РольДоступна("мп_ПросмотрДокументовТОиР") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ПодразделениеПользователя = РеквизитыКонстант["ПодразделениеПользователя"];
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	
	Если РольДоступна("мп_БригадирТОиР") Тогда
		Если ПодразделениеПользователя = Подразделение 
			И (Перечисления.мп_СтатусыОбмена.Создан = СтатусОбмена) Тогда
			Возврат Истина;
		ИначеЕсли ПодразделениеПользователя = Подразделение И Не ЗначениеЗаполнено(Ответственный) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	СтатусыДляРедактирования = Новый Массив;
	СтатусыДляРедактирования.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	СтатусыДляРедактирования.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);
	
	Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда
		Если ПодразделениеПользователя = Подразделение И ТекущийПользователь = Ответственный
			И (Не СтатусыДляРедактирования.Найти(СтатусОбмена) = Неопределено) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Функция - Доступность параметра отбора документов
//
// Параметры:
//  ТекущийПользователь	 - Справочник.Пользователи 	 - Ответственный документа
// 
// Возвращаемое значение:
//  Структура - 
//
Функция ДоступностьПараметраОтбораДокументов(ТекущийПользователь) Экспорт

	ДоступностьОтбора = Новый Структура;
	ДоступностьОтбора.Вставить("Подразделение", Ложь);
	ДоступностьОтбора.Вставить("Ответственный", Ложь);

	Если РольДоступна("ПолныеПрава") Или РольДоступна("мп_АдминистрированиеТОиР") 
		Или РольДоступна("мп_ПросмотрДокументовТОиР")
		Или РольДоступна("мп_БригадирТОиР") Тогда
		
		ДоступностьОтбора.Подразделение = Истина;
		ДоступностьОтбора.Ответственный = Истина;

		Возврат ДоступностьОтбора;

	КонецЕсли;

	Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда

		ДоступностьОтбора.Подразделение = Ложь;
		ДоступностьОтбора.Ответственный = Ложь;

		Возврат ДоступностьОтбора;
	Иначе

		Возврат Неопределено;

	КонецЕсли;

КонецФункции

// Функция - Подразделения пользователей
// Получает массив подразделений из справочника пользователи и ранее использованных подразделения в документах
//
// Возвращаемое значение:
// Подразделения  - Массив - Список подразделений
//
Функция ПодразделенияПользователей() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ вт_Подразделения
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	мп_РегистрацияПроверокОборудования.Подразделение
	|ИЗ
	|	Документ.мп_РегистрацияПроверокОборудования КАК мп_РегистрацияПроверокОборудования
	|ГДЕ
	|	НЕ мп_РегистрацияПроверокОборудования.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаработкаОбъектовЭксплуатации.Подразделение
	|ИЗ
	|	Документ.НаработкаОбъектовЭксплуатации КАК НаработкаОбъектовЭксплуатации
	|ГДЕ
	|	НЕ НаработкаОбъектовЭксплуатации.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Подразделения.Подразделение КАК Подразделение
	|ИЗ
	|	вт_Подразделения КАК вт_Подразделения";

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Новый Массив;
		
	Иначе
		
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Подразделение");
		
	КонецЕсли;

КонецФункции

Функция ХарактеристикиПоНоменклатуре(Знач Номенклатура) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_Характеристика
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.Номенклатура).ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|			И ((ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.Номенклатура)) = &Номенклатура)
	|			И (ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ((ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.ВидыНоменклатуры)) = ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры)
	|			И (НЕ ВидыНоменклатуры.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Характеристика.Ссылка КАК Характеристика
	|ИЗ
	|	вт_Характеристика КАК вт_Характеристика";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Характеристика");
	КонецЕсли;

КонецФункции

Функция СерииПоНоменклатуре(Знач Номенклатура) Экспорт
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_ВидыНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|			И (ВидыНоменклатуры.ИспользоватьСерии)
	|			И (Номенклатура.Ссылка = &Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ВидыНоменклатуры КАК вт_ВидыНоменклатуры
	|		ПО (СерииНоменклатуры.ВидНоменклатуры = вт_ВидыНоменклатуры.Ссылка)";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Серия");
	КонецЕсли;
	
КонецФункции

Функция СкладыПоКонстанте() Экспорт
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Склад = ЗначенияКонстант["ГруппаСкладовОбменаДанными"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка В ИЕРАРХИИ(&Склад)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Склад");
	КонецЕсли;

КонецФункции

#КонецОбласти

Функция ПолучитьЗначенияКонстант() Экспорт
	Возврат ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
КонецФункции

Функция АдминистраторТОиР() Экспорт
	
	Возврат РольДоступна("мп_АдминистрированиеТОиР");
	
КонецФункции

#Область Права

Функция ДоступныеПрава() Экспорт
	Возврат ОбщегоНазначенияПовтИсп.ДоступныеПрава();
КонецФункции

#КонецОбласти

// Область содержит процедуры и функции для работы
// с персональными настройками пользователей мобильного приложения.
// Настройки хранятся в регистре сведений ХранилищеПерсональныхНастроек
// через хранилище настроек ХранилищеПерсональныхНастроек.
//
#Область ПерсональныеНастройки

// Возвращает сохраненную персональную настройку пользователя 
// или значение по умолчанию, если настройка не найдена.
//
// Параметры:
//	Пользователь	-	СправочникСсылка.Пользователи - пользователь,
//					для которого сохраняется настройка.
//	ОбъектНастройки	-	Строка - идентификатор объекта или формы,
//			к которому относится настройка (например, "ФормаСписка_ЗаявкаТОиР").
//	ВидНастройки	-	Строка - вид настройки внутри объекта
//				(например, "СписокСтатусов", "ОтборПоПодразделению").
//	ЗначениеПоУмолчанию	-	Произвольный - значение, возвращаемое,
//					если настройка еще не была сохранена.
//
// Возвращаемое значение:
//  Произвольный	-	сохраненное значение настройки или ЗначениеПоУмолчанию,
//				если запись не найдена или не может быть прочитана.
//
Функция ПерсональнаяНастройка(Пользователь, ОбъектНастройки, ВидНастройки, ЗначениеПоУмолчанию) Экспорт

	Возврат ХранилищаНастроек.ХранилищеПерсональныхНастроек.ЗагрузитьНастройку(
		Пользователь, ОбъектНастройки, ВидНастройки, ЗначениеПоУмолчанию);

КонецФункции

// Возвращает сохраненную персональную настройку пользователя 
// или значение по умолчанию, если настройка не найдена.
//
// Параметры:
//	Пользователь	-	СправочникСсылка.Пользователи - пользователь,
//					для которого сохраняется настройка.
//	ОбъектНастройки	-	Строка - идентификатор объекта или формы,
//			к которому относится настройка (например, "ФормаСписка_ЗаявкаТОиР").
//	НастройкиПоУмолчанию	-	Структура - ключ это вид настройки, а значение список по умолчанию
//
// Возвращаемое значение:
//  Произвольный	-	сохраненное значение настройки или ЗначениеПоУмолчанию,
//				если запись не найдена или не может быть прочитана.
//
Функция ПолучитьПерсональныеНастройки(Пользователь, ОбъектНастройки, НастройкиПоУмолчанию) Экспорт

	Возврат ХранилищаНастроек.ХранилищеПерсональныхНастроек.ЗагрузитьНастройки(
		Пользователь, ОбъектНастройки, НастройкиПоУмолчанию);

КонецФункции

// Сохраняет персональную настройку пользователя для указанного объекта и вида настройки.
//
// Параметры:
//  Пользователь	-	СправочникСсылка.Пользователи - пользователь,
//				для которого сохраняется настройка.
//	ОбъектНастройки - Строка - идентификатор объекта или формы,
//					к которому относится настройка.
//  ВидНастройки	-	Строка - вид настройки внутри объекта.
//  Значение	-	Произвольный - сохраняемое значение настройки;
//				будет помещено в ресурс регистра в виде ХранилищеЗначения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура СохранитьПерсональнуюНастройку(Пользователь, ОбъектНастройки, ВидНастройки, Значение) Экспорт

	ХранилищаНастроек.ХранилищеПерсональныхНастроек.СохранитьНастройку(
		Пользователь, ОбъектНастройки, ВидНастройки, Значение);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаписатьИнформациюВЖурналСтрокой(Контектс, ТекстОшибки) Экспорт
	
	HTTPCore.ЗаписатьИнформациюВЖурналСтрокой(Контектс, ТекстОшибки);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСоединения()
	
	Константы.Login.Установить("Jenkins");
	Константы.Password.Установить("Y7vqKb96");
//	Константы.СтрокаПодключенияHTTP.Установить("ERP_TOIR/hs/TOIRMobileExchange");
	Константы.СтрокаПодключенияHTTP.Установить("ERP_MOB_API/hs/TOIRMobileExchange");
//	Константы.СтрокаПодключенияIP.Установить("10.0.26.86");
	Константы.СтрокаПодключенияIP.Установить("supererp.mechel.com");
	Константы.ИспользоватьПодключениеSSL.Установить(Истина);
	Константы.БазаЕРП.Установить(Перечисления.Апи_БазыЕРП.ERP_YKUZ);
	Константы.СтрокаПодключенияПорт.Установить(0);
	Константы.ИспользоватьВерсиюДанныхЕРП.Установить(Ложь);
	Константы.МаксимальныйРазмерФото.Установить(5);
	
КонецПроцедуры

Функция ТекущаяДатаСервера() Экспорт
	Возврат ТекущаяДатаСеанса();
КонецФункции
#КонецОбласти
